IDEA Open Model
EdgePositionType Enumeration
Compatible with IDEA StatiCa 20.1
 Position of reinforcement on edge
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum EdgePositionType
Public Enumeration EdgePositionType
Members
Member name | Value | Description
WholeLength | 0 |  WholeLength
PartEdgeFromBegin | 1 |  Part edge from beginning
PartEdgeFromEnd | 2 |  Part edge from end
PartEdgeToSegment | 3 |  Part edge to the end
See Also
Reference
IdeaRS.OpenModel.Detail Namespace